## Staging: heartbeat
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.heartbeat_testing will be created
  + resource "aws_cloudwatch_event_rule" "heartbeat_testing" {
      + arn                 = (known after apply)
      + description         = "heartbeat_testing event rule"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "heartbeat_testing"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(*/1 * * * * *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.heartbeat will be created
  + resource "aws_cloudwatch_event_target" "heartbeat" {
      + arn            = "arn:aws:lambda:ca-central-1:239043911459:function:heartbeat"
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>